insert into voltage_list (voltage) values
('110 kV'), ('150 kV'), ('220 kV'), ('330 kV'), ('400 kV'), ('500 kV'), ('750 kV');

insert into disp_center (foregin, center_name) values
(1, 'Augstsprieguma tikls'), (1, 'Elering AS'), (1, 'Litgrid AB'), 
(1, 'Fingrid'), (1, 'ГПО «Белэнерго»'), (1, 'НЭК «Укрэнерго»'), 
(0, 'ЦДУ'), (0, 'ОДУ Северо-Запада'), (0, 'ОДУ Центра'), 
(0, 'Ленинградское РДУ'), (0, 'Новгородское РДУ'), (0, 'Балтийское РДУ'),
(0, 'Кольское РДУ'), (0, 'Карельское РДУ'), (0, 'Архангельское РДУ'),
(0, 'Коми РДУ'), (0, 'Вологодское РДУ'), (0, 'Тверское РДУ');

insert into managing_role (managing_type) values
('administer'), ('control'), ('infornation');

insert into current_mode (cm_type) values
('work'), ('repair'), ('reserve'), ('damage'), ('special');

insert into object_type (ot_type) values
('Substation'), ('KRUE'), ('GRES'), ('Thermal'), ('Hydro'), ('GAES'), ('NPP');

insert into equipment (eq_name, eq_voltage, eq_mode) values
('Р-1-750', '7', '1'), 
('Р-2-750', '7', '1'),
('3-АТ', '7', '1'),  
('АТ-1', '7', '2'), 
('АТ-2', '7', '1'), 
('2-ШР-330', '4', '1'),
('ТОР-1', '7', '1'), 
('ТОР-2', '7', '2'), 
('Р-330', '4', '4'),  
('СТАТКОМ', '1', '5'), 
('УШР-110', '1', '4');  

insert into object_list (object_name, object_type, object_manage, object_voltage, object_eq) values
('ПС 400 кВ Выборгская', '1', '8', '5', '10'), ('ПС 400 кВ Выборгская', '1', '10', '4', null),
('ПС 330 кВ Восточная', '1', '10', '4', '7'), ('Киришская ГРЭС', '3', '8', '4', '8'),
('ПС 330 кВ Чудово', '2', '11', '4', '11'), ('ПС 750 кВ Ленинградская', '1', '8', '7', '1'),
('ПС 750 кВ Ленинградская', '1', '8', '4', null), ('Ленинградская АЭС', '7', '11', '4', '3'),
('Ленинградская АЭС', '7', '8', '7', '9'), ('ПС 330 кВ Гатчинская', '1', '11', '4', null),
('ПС 330 кВ Кингисеппская', '2', '8', '4', '4'), ('ПС 330 кВ Балти', '2', '1', '4', null),
('ПС 330 кВ Виру', '2', '1', '4', '5'), ('Крунио ГАЭС', '6', '3', '4', null),
('ПС 330 кВ Советск', '1', '12', '4', '6'), ('ПС 330 кВ Советск', '1', '12', '1', null),
('ПС 110 кВ Нестеров', '5', '2', '1', null), ('ПС 110 кВ Кибартай', '5', '2', '1', null),
('ПС 400 кВ Кюми', '1', '4', '5', null), ('ПС 110 кВ Юлликкяля', '1', '4', '5', null),
('Калининская АЭС', '7', '9', '7', '2'), ('ПС 750 кВ Белозерская', '1', '18', '7', null);

insert into power_lines (line_name, line_voltage, line_managing, line_dispatch, line_mode, line_start, line_end) values
('ВЛ 400 кВ Выборгская – Кюми', 				'5', '1', '4', '1', '1', '19'),
('ВЛ 400 кВ Выборгская – Юлликкяля', 			'5', '1', '4', '2', '1', '20'),
('ВЛ 330 кВ Восточная – Выборгская I цепь', 	'4', '1', '8', '1', '3', '2'),
('ВЛ 330 кВ Восточная – Выборгская II цепь', 	'4', '1', '8', '2', '3', '2'),
('ВЛ 330 кВ Ленинградская АЭС – Восточная', 	'4', '1', '8', '1', '8', '3'),
('КВЛ 330 кВ Киришская ГРЭС – Восточная I цепь','4', '1', '8', '2', '4', '3'),
('ВЛ 330 кВ Киришская ГРЭС – Восточная II цепь','4', '1', '8', '1', '4', '3'),
('ВЛ 330 кВ Киришская ГРЭС – Чудово',			'4', '1', '10', '1', '4', '5'),
('ВЛ 330 кВ Ленинградская – Чудово',			'4', '1', '11', '1', '7', '5'),
('ВЛ 750 кВ Ленинградская АЭС – Ленинградская',	'7', '1', '8', '1', '8', '6'),
('ВЛ 750 кВ Калининская АЭС – Ленинградская',	'7', '1', '7', '2', '21', '6'),
('ВЛ 750 кВ Белозерская – Ленинградская',		'7', '1', '9', '1', '22', '6'),
('ВЛ 330 кВ Ленинградская АЭС – Гатчинская',	'4', '1', '10', '1', '8', '10'),
('ВЛ 330 кВ Гатчинская – Кингисеппская',		'4', '1', '8', '1', '10', '11'),
('КВЛ 330 кВ Балти – Кингисеппская',			'4', '1', '1', '2', '12', '11'),
('ВЛ 330 кВ Виру – Кингисеппская',				'4', '1', '1', '1', '13', '11'),
('ВЛ 330 кВ Круонио ГАЭС – Советск',			'4', '1', '3', '4', '14', '15'),
('ВЛ 110 кВ О-5 Советск – Пагегяй Л-104',		'1', '1', '12', '1', '16', '17'),
('ВЛ 110 кВ О-5 Советск – Пагегяй Л-105',		'1', '1', '12', '2', '16', '17'),
('ВЛ 110 кВ О-15 Нестеров – Кибартай',			'1', '1', '3', '1', '16', '18');

insert into worker_list (worker_name, worker_workplace) values
('Егоренков Евгений Александрович', '1'),
('Корешков Александр Валерьевич', '2'),
('Пашкевич Александр Леонидович', '3'),
('Родченков Виктор Юрьевич', '4'),
('Романенко Андрей Михайлович', '5'),
('Рязанов Сергей Николаевич', '6'),
('Антипенков Андрей Викторович', '7'),
('Белов Денис Иванович', '8'),
('Булыгин Антон Александрович', '9'),
('Готовцев Сергей Леонидович', '10'),
('Жакун Степан Степанович', '11'),
('Захаренков Алексей Игоревич', '12'),
('Иванов Денис Александрович', '13'),
('Назаров Алексей Александрович', '14'),
('Прачкин Артём Геннадьевич', '15'),
('Сергеев Олег Леонидович', '16'),
('Типикин Андрей Михайлович', '17'),
('Фещенко Анатолий Владимирович', '18'),
('Изовит Михаил Евгеньевич', '19'),
('Бобылев Сергей Петрович', '20'),
('Виноградов Алексей  Викторович', '21'),
('Дунаев Валерий Леонидович', '22');

insert into powerlines_repair_plan (rp_powerlines, repair_start_at, repair_end_at) values
('1', '2021-05-29 18:00:00', '2021-06-19 22:00:00'),
('2', '2020-10-21 12:00:00', '2020-10-20 18:00:00'),
('18', '2021-06-21 15:00:00', '2021-03-24 21:00:00'),
('20', '2021-10-15 21:00:00', '2021-05-02 21:00:00'),
('5', '2021-03-19 14:00:00', '2021-06-13 11:00:00'),
('6', '2020-10-06 06:00:00', '2021-04-18 19:00:00'),
('10', '2021-04-04 05:00:00', '2021-06-13 11:00:00'),
('11', '2020-10-18 19:00:00', '2020-10-28 17:00:00'),
('1', '2021-08-10 20:00:00', '2021-04-04 05:00:00'),
('8', '2020-11-01 20:00:00', '2021-04-04 05:00:00'),
('3', '2021-08-18 17:00:00', '2021-08-28 17:00:00'),
('6', '2021-04-18 19:00:00', '2021-08-10 20:00:00'),
('9', '2021-06-13 11:00:00', '2021-09-13 11:00:00'),
('15', '2020-09-18 19:00:00', '2021-06-17 07:00:00');





